[
  {
    "name": "IEEE",
    "about": "IEEE SPIT gives you a platform to present and identify yourselves as an important element of the organisation and have access to information in various fields of technology .Student members get ample of opportunities to work on these skillsets."
  },
  {
    "name": "ECELL",
    "about": "We, at the Entrepreneurship Cell of S.P.I.T, strive to generate enthusiasm and awareness about start ups and entrepreneurship in our college."
  },
  {
    "name": "ITSA",
    "about": "We are a group of 6 students who try to bring the department together. We have fun and we also learn together. So come join us on this journey of life called ENGINEERING!!!"
  },
  {
    "name": "CSI",
    "about": "We are the C.S.I. Student Branch of Sardar Patel Institute of Technology. Formed in 2009, CSI-SPIT is an altruistic society in college initiating workshops, events and seminars to explore the cornucopia of information other than the regular curriculum offered by the university. As part of our endeavour to bring together and assimilate various aspects of technical and non-technical education, number of seminars and workshops are conducted by professionals imparting knowledge to the students of the college. We also encourage member students to organize events by themselves so that it imbibes in them the skills of management, self-confidence and helps to exchange views and information, learn and share ideas. An annual 10 day industrial visit cum trip is organized to different parts of the country.This facilitates the students' interaction with the industries in different parts of the country and gives them the valuable experience of witnessing the ground realities of the work environment intertwined with the pleasures of visiting the most beautiful places in India. Every person on this planet is blessed with some or the other quality and is dextrous at something. We at CSI-SPIT aim at exploring the acme within every individual so that they can realize their dreams in reality."
  },
  {
    "name": "WIE",
    "about": "IEEE WIE SPIT is the Student Branch WIE Affinity Group of Sardar Patel Institute of Technology located in Region 10"
  },
  {
    "name": "FACE",
    "about": "F.A.C.E. is a techno-cultural committee of S.P.I.T. that is exclusively for the Computer Engineering Department. We aim to make the learning fun with various engaging workshops. Some of our flagship events Monsoon trek, our Signature FACE Cup, Branch Day strengthen the bonds of friendship among Computer students along with working as fun distractor to their fully loaded minds."
  },
  {
    "name": "SPORTS",
    "about": "SPoorthi is the sports fest organized by Sardar Patel Institute Of Technology which brings together thousands of individuals across Mumbai and other cities to compete amongst each other and be the best. The series of sports events organized at SPoorthi aim at challenging the skills of an individual thus boosting it and mainly keeping the sportsmanspirit within us ALIVE. The fire within should never burn out is what is the motto of this fest."
  },
  {
    "name": "IETE",
    "about": "The Institution of Electronics and Telecommunication Engineers(IETE) is India’s leading recognised professional society devoted to the advancement of Science and Technology of Electronics, Telecommunication Computers and IT. Founded in 1953. The IETE is the National Apex Professional body of Electronics and Telecommunication, Computer Science and IT Professionals. The Institution provides leadership in Scientific and Technical areas of direct importance to the national development and economy. Government of India has recognised IETE as a Scientific and Industrial Research Organization (SIRO) and also notified as an educational Institution of national eminence. The objectives of IETE focus on advancing electro-technology. The IETE conducts and sponsors technical meetings, conferences, symposia, and exhibitions all over India, publishes technical journals and provides continuing education as well as career advancement opportunities to its members."
  },
  {
    "name": "IIC",
    "about": "IIC SPIT focuses on creating complete ecosystem which will foster the culture of Innovation across the institution from ideas generation to pre-incubation, incubation and graduating from the incubator as successful start-ups."
  }
]